---
title: StairsPathType
classe: Autodesk.Revit.DB.Architecture.StairsPathType
namespace: Autodesk.Revit.DB.Architecture
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 11
---

# StairsPathType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId ArrowheadTypeId { get; set; }` | `stairsPathType.ArrowheadTypeId` | ElementId |
| `Double DistanceToCutMark { get; set; }` | `stairsPathType.DistanceToCutMark` | Double |
| `Boolean DrawForEachRun { get; set; }` | `stairsPathType.DrawForEachRun` | Boolean |
| `Boolean EndAtRiser { get; set; }` | `stairsPathType.EndAtRiser` | Boolean |
| `Boolean FullStepArrow { get; set; }` | `stairsPathType.FullStepArrow` | Boolean |
| `StairsPathLineShapeAtCorner LineShapeAtCorner { get; set; }` | `stairsPathType.LineShapeAtCorner` | StairsPathLineShapeAtCorner |
| `Boolean ShowArrowheadToCutMark { get; set; }` | `stairsPathType.ShowArrowheadToCutMark` | Boolean |
| `StairsPathDirection StairsPathDirection { get; }` | `stairsPathType.StairsPathDirection` | StairsPathDirection |
| `Double StartExtension { get; set; }` | `stairsPathType.StartExtension` | Double |
| `Boolean StartFromRiser { get; set; }` | `stairsPathType.StartFromRiser` | Boolean |
| `ElementId StartSymbolTypeId { get; set; }` | `stairsPathType.StartSymbolTypeId` | ElementId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```